cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "gdbm"
brew "libyaml"
brew "openssl"
brew "readline"
brew "sqlite"
brew "python"
brew "ansible"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "csshx"
brew "curl"
brew "direnv"
brew "git"
brew "git-archive-all"
brew "git-crypt"
brew "git-flow-avh"
brew "git-lfs"
brew "git-review"
brew "gnu-sed"
brew "gradle"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "libksba"
brew "libtool"
brew "maven"
brew "molecule"
brew "node"
brew "nvm"
brew "openssl@1.1"
brew "packer"
brew "perl"
brew "pkg-config"
brew "ruby"
brew "shellcheck"
brew "terraform"
brew "terragrunt"
brew "tree"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"

cask "adoptopenjdk8"
cask "atom"
cask "bitwarden"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "gpg-suite"
cask "hipchat"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "jiggler"
cask "menumeters"
cask "microsoft-teams"
cask "miniconda"
cask "powershell"
cask "sizeup"
cask "skype"
cask "skype-for-business"
cask "slack"
cask "spotify"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "whatsapp"
cask "zoomus"

######
# NSFW
######
#cask "1password"
#cask "dropbox"
#cask "evernote"
#cask "keybase"
