cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "adoptopenjdk/openjdk"

brew "gdbm"
brew "libyaml"
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "ansible"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "csshx"
brew "curl"
brew "direnv"
brew "git"
brew "git-archive-all"
brew "git-crypt"
brew "git-flow-avh"
brew "git-lfs"
brew "git-review"
brew "gnu-sed"
brew "gnupg"
brew "gradle"
brew "libksba"
brew "libtool"
brew "maven"
brew "molecule"
brew "nvm"
brew "packer"
brew "perl"
brew "pkg-config"
brew "python"
brew "ruby"
brew "shellcheck"
brew "tree"
brew "vagrant-completion"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"

cask "1password"
cask "adoptopenjdk11"
cask "corona-tracker"
cask "cyberduck"
cask "docker"
cask "dropbox"
cask "evernote"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "google-photos-backup-and-sync"
cask "gpg-suite"
cask "intellij-idea-ce"
cask "jiggler"
cask "keybase"
cask "menumeters"
cask "microsoft-teams"
cask "miniconda"
cask "nordvpn"
cask "sizeup"
cask "skype"
cask "skype-for-business"
cask "spotify"
cask "vagrant"
cask "vagrant-vmware-utility"
cask "vlc"
cask "whatsapp"
cask "zoomus"

########################
# Manual effort required
########################
# VirtualBox formulaes are commented out here as they will fail and manual intervention will be required
# See https://forums.developer.apple.com/thread/116604
# cask "virtualbox"
# cask "virtualbox-extension-pack"
