cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'

brew 'libyaml'
brew 'openssl@1.1'
brew 'gdbm'
brew 'openssl'
brew 'readline'
brew 'sqlite'
brew 'python'

brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'cf-cli'
brew 'csshx'
brew 'curl'
brew 'direnv'
brew 'git'
brew 'git-archive-all'
brew 'git-crypt'
brew 'git-flow-avh'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gradle'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libgpg-error'
brew 'libksba'
brew 'libtool'
brew 'maven'
brew 'node'
brew 'packer'
brew 'perl'
brew 'pkg-config'
brew 'ruby'
brew 'shellcheck'
brew 'terraform'
brew 'terragrunt'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

cask '1password'
cask 'bbedit'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'hipchat'
cask 'intellij-idea-ce'
cask 'caskroom/versions/java8'
cask 'jiggler'
cask 'keybase'
cask 'sizeup'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'whatsapp'
